<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <link href="style.css" rel="stylesheet">
    <title>FalGir</title>
</head>
<!--Tavajoh!-->
<!--in Tool jahat Test sakhte shode va aslan tavajohe (Ziadi be UI) nashode ast.-->
<!--Mavafagh bashid.-->
<body>
<h4 class="text"> فال دیوان حافظ</h4>
<div class="fal">
    <?php
    if ($_POST["button"]) {
        $fal_ha = array("به هر کسی زود اطمینان می کنید. قسم خورده بودید دیگر کارهای ناشایست انجام ندهید ولی عهد خود را شکسته و بسیار پشیمانید. رو به خدا آورید که شما را هدایت می کند و در زیر سایه ی اوست که به نیت و مقصود خودتان می رسید. صبر داشته باشید.",
            " صلاح و مشورت بهترین راهنما برای آینده روشن تان می باشد. دعای سلامتی همیشه با شماست و از بلایا ایمن هستید. در همه حال انفاق و کرم کنید که این کار روشن کننده ی راهتان می اشد و از این کار پشیمان نخواهید شد. مواظب صحبت کردنتان هم باشید که از آن به ضرر خودتان استفاده می کنند. از لحظه لحظه ی زندگیتان استفاده کنید که وقت طلاست.",
            " او تو را خیلی دوست دارد و تا زمان مرگ فراموشت نخواهد کرد ولی خود را در مقابلش کوچک نکن. تو هم به او فکر می کنی. مصلحت در این است که یار عشق خود را بروز ندهد و همه چیز را با شوز دل تحمل کند تا تو هم در مراحل عشق به پای او برسی.",
            " الان موقع حرف زدن نیست، کمی تال کن. فکری به حال خودت بکن تا از این غم رهایی پیدا کنی. تا جوانی می توانی کاری انجام دهی. نگو فعلا جوانم و وقت برای توبه زیاد است. برای رسیدن به مراد باید رنج و سختی و انتظار بکشی و اگر عجله کنی همه چیز را بر باد می دهی.",
            " نیرنگ و حیله هایی که در مورد شما به کار برده اند یکی پس از دیگری خنثی شده و این کار خداست. ملامت و ناراحتی تان دیگر تمام شده است. خودتان اراده کرده اید و غم را از دلتان بیرون نهاده اید. به دنبال حل معمایی هستید که به این زودی حل نمی شود.",
            " امیدوار باش. ناامیدی علامت نرسیدن است. بالاخره یکی از نیات تو مورد قبول خداوند واقع می شود. با این غصه ا که می خوری خود را بیمار کرده ای اطرافیان تو هم از غصه ی تو غصه می خورند خوددار باش و امیدوار."
        );
        $rand_keys = array_rand($fal_ha, 2);
        echo $fal_ha[$rand_keys[0]];
        echo $fal_ha[$rand_keys[1]];
        echo $fal_ha[$rand_keys[2]];
        echo $fal_ha[$rand_keys[3]];
        echo $fal_ha[$rand_keys[4]];
        echo $fal_ha[$rand_keys[5]];
        echo $fal_ha[$rand_keys[6]];
    }
    ?>
</div>
<form action="" method="post">
<div class="Input">
    <input class="button" type="submit" value="فال بگیر" name="button">
</form>
</div>
</body>
<footer>
    <div class="footer">طراحی شده با ❤️ از طرف امیرحسین جهانگیر ️</div>
</footer>
</html>

